import 'package:televerse/televerse.dart';

void main(List<String> arguments) async {
  final bot = Bot('8504586081:AAFvOlFhmYR4eIhJXKTEics2uvs89JxmeY8');

  // Устанавливаем обработчик команды /start
  bot.command('start', (ctx) async {
    // Создаем reply-клавиатуру с двумя кнопками
    final keyboard = Keyboard()
        .text('Кнопка 1')
        .text('Кнопка 2')
        .resized(); // Автоматически подстраивает размер клавиатуры

    await ctx.reply(
      'Выберите опцию:',
      replyMarkup: keyboard, // добавляем клавиатуру к сообщению
    );
  });

  // Обработчик нажатия на первую кнопку
  bot.text('Кнопка 1', (ctx) async {
    await ctx.reply('Вы нажали на первую кнопку! 🎯');
  });

  // Обработчик нажатия на вторую кнопку
  bot.text('Кнопка 2', (ctx) async {
    await ctx.reply('Вы нажали на вторую кнопку! 🚀');
  });

  await bot.start();
}
